#include <stdio.h>

int main() {
  int n = 2;
  int a[2][2] = {
    {1, 3},
    {2, 4}
  };
  
  int det;
  if(n >= 4) {
    for() {

    }
  }
  if (n == 3) {   // サラスの方法
    det = a[0][0] * a[1][1] * a[2][2];
    det += a[1][0] * a[2][1] * a[0][2];
    det += a[2][0] * a[0][1] * a[1][2];
    det -= a[2][0] * a[1][1] * a[0][2];
    det -= a[1][0] * a[0][1] * a[2][2];
    det -= a[0][0] * a[2][1] * a[1][2];
  }
  if(n == 2) {
    det = a[0][0] * a[1][1];
    det -= a[0][1] *a[1][0];
  }
  if(n == 1) {
    det = a[0][0];
  }

  printf("%d\n", det);
}
